Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.10/PIC32CK-SG01/atdf/PIC32CK0512SG01100.atdf
          </instance>
          <instance name="ICB_NS">
            <register-group name="ICB_NS" name-in-module="ICB" address-space="base" offset="0xE002E000"/>
          </instance>
        </module>
        <module name="IDAU" id="04250" name2="sec_idau_v3" version="3a0">
          <instance name="IDAU">
            <register-group name="IDAU" name-in-module="IDAU" address-space="base" offset="0x4480C000"/>
            <parameters>
              <param name="INSTANCE_ID" value="38" caption="Instance index for IDAU"/>
              <param name="MCLK_ID_APB" value="69" caption="Index for IDAU APB clock"/>
              <param name="PAC_ID" value="38" caption="Index for IDAU registers write protection"/>
              <param name="GRANULARITY_ANSC" value="0x1000" caption="Application Non-Secure Callable region granularity"/>
              <param name="GRANULARITY_ANS" value="0x1000" caption="Application Non-Secure region granularity"/>
              <param name="GRANULARITY_AS" value="0x1000" caption="Application Secure region granularity"/>
              <param name="GRANULARITY_RS" value="0x1000" caption="RAM Secure region granularity"/>
              <param name="GRANULARITY_RNS" value="0x1000" caption="RAM Non-Secure region granularity"/>
              <param name="GRANULARITY_BNSC" value="0x1000" caption="Boot Flash Non-Secure Callable region granularity"/>
              <param name="GRANULARITY_BOOTPROT" value="0x1000" caption="BOOTPROT region granularity"/>
              <param name="GRANULARITY_BS" value="0x1000" caption="Boot Flash Secure region granularity"/>
              <param name="REGION_CMCCDS" value="0x01" caption="CMCC DATA RAM Secure region ID"/>
              <param name="REGION_CMCCTS" value="0x02" caption="CMCC TAG RAM Secure region ID"/>
              <param name="REGION_CMCCVS" value="0x03" caption="CMCC VALID RAM Secure region ID"/>
              <param name="REGION_BOOTROM" value="0x04" caption="Boot ROM region ID"/>
              <param name="REGION_BS" value="0x05" caption="Boot Flash Secure region ID"/>
              <param name="REGION_BNSC" value="0x06" caption="Boot Flash Non-Secure Callable region ID"/>
              <param name="REGION_CFMS" value="0x07" caption="CONFIGURATION Flash Secure region ID"/>
              <param name="REGION_AS" value="0x08" caption="Application Secure region ID"/>
              <param name="REGION_ANSC" value="0x09" caption="Application Non-Secure Callable region ID"/>
              <param name="REGION_ANS" value="0x0A" caption="Application Non-Secure region ID"/>
              <param name="REGION_RS" value="0x0D" caption="RAM Secure region ID"/>
              <param name="REGION_RNS" value="0x0E" caption="RAM Non-Secure region ID"/>
              <param name="REGION_HPB0" value="0x0F" caption="Peripheral Bus A region ID"/>
              <param name="REGION_HPB1" value="0x10" caption="Peripheral Bus B region ID"/>
              <param name="REGION_HPB2" value="0x11" caption="Peripheral Bus C region ID"/>
              <param name="REGION_USBHS" value="0x12" caption="USB SFR region ID"/>
              <param name="REGION_HSM" value="0x13" caption="HSM region ID"/>
              <param name="REGION_OTHER" value="0x00" caption="Other region ID"/>
            </parameters>
          </instance>
        </module>
        <module name="ITM" id="SYSTEM_IP" version="1.0.0">
          <instance name="ITM">
            <register-group name="ITM" name-in-module="ITM" address-space="base" offset="0xE0000000"/>
          </instance>
        </module>
        <module name="MCLK" id="04158" name2="clk_mclk_v1" version="1a0">
          <instance name="MCLK">
            <register-group name="MCLK" name-in-module="MCLK" address-space="base" offset="0x44012000"/>
            <parameters>
              <param name="DIV_CLK_NUM" value="1"/>
              <param name="INSTANCE_ID" value="9" caption="Instance index for MCLK"/>
              <param name="MCLK_ID_APB" value="41" caption="Index for MCLK APB clock"/>
              <param name="PAC_ID" value="9" caption="Index for MCLK registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="MPU" id="SYSTEM_IP" version="1.0.0">
          <instance name="MPU">
            <register-group name="MPU" name-in-module="MPU" address-space="base" offset="0xE000ED90"/>
          </instance>
          <instance name="MPU_NS">
            <register-group name="MPU_NS" name-in-module="MPU" address-space="base" offset="0xE002ED90"/>
            <parameters>
              <param name="__MPU_NS_REGIONS" value="8" caption="Number of MPU_NS regions"/>
              <param name="__MPU_S_REGIONS" value="8" caption="Number of MPU_S regions"/>
            </parameters>
          </instance>
        </module>
        <module name="NVIC" id="SYSTEM_IP" version="1.0.0">
          <instance name="NVIC">
            <register-group name="NVIC" name-in-module="NVIC" address-space="base" offset="0xE000E100"/>
          </instance>
          <instance name="NVIC_NS">
            <register-group name="NVIC_NS" name-in-module="NVIC" address-space="base" offset="0xE002E100"/>
            <parameters>
              <param name="NUM_IRQ" value="158" caption="Number of interrupt request lines"/>
            </parameters>
          </instance>
        </module>
        <module name="OSC32KCTRL" id="03717" name2="osc_osc32kctrl_u2400_v2" version="2a0">
          <instance name="OSC32KCTRL">
            <register-group name="OSC32KCTRL" name-in-module="OSC32KCTRL" address-space="base" offset="0x4400E000"/>
            <signals>
              <signal group="XIN32" function="XIN32" pad="PB02"/>
              <signal group="XOUT32" function="XOUT32" pad="PB03"/>
            </signals>
            <parameters>
              <param name="INSTANCE_ID" value="7" caption="Instance index for OSC32KCTRL"/>
              <param name="MCLK_ID_APB" value="39" caption="Index for OSC32KCTRL APB clock"/>
              <param name="PAC_ID" value="7" caption="Index for OSC32KCTRL registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="OSCCTRL" id="03718" name2="osc_oscctrl_u2401_v2" version="2b0">
          <instance name="OSCCTRL">
            <register-group name="OSCCTRL" name-in-module="OSCCTRL" address-space="base" offset="0x4400C000"/>
            <signals>
              <signal group="XIN" function="XIN" pad="PD00"/>
              <signal group="XOUT" function="XOUT" pad="PD01"/>
            </signals>
            <parameters>
              <param name="DFLL48M_ATEST_IMPLEMENTED" value="1" caption="DFLL48M ATEST register implemented"/>
              <param name="DFLL48M_ATEST_SIZE" value="8" caption="number of effective bits in DFLL48M ATEST register"/>
              <param name="DFLL48M_IS_STARTUP_OSCILLATOR" value="1" caption="DFLL48M is startup oscillator"/>
              <param name="DFLL48M_RC48MCAL0_PORVAL" value="0" caption="Defines the RC48MCAL0 register reset value after POR."/>
              <param name="DIV_8MHZ_NUM" value="2"/>
              <param name="FRACDIVS_NUM" value="1" caption="Number of FRACDIVs"/>
              <param name="FRACDIV_DIVIDER_RESET_VAL" value="32" caption="Fracdiv Divider reset value"/>
              <param name="FRACDIV_PLLSRC" value="0" caption="Indice of the PLL that is source of the FRACDIV"/>
              <param name="GCLK_ID_DFLL48M" value="0" caption="Index of Generic Clock for DFLL48"/>
              <param name="GCLK_ID_PLL" value="1" caption="Index of Generic Clock for PLL"/>
              <param name="PLLS_NUM" value="1" caption="Number of PLLs"/>
              <param name="PLL0_OUTPUTS_NUM" value="6" caption="number of clock outputs for PLL0"/>
              <param name="PLL1_OUTPUTS_NUM" value="0" caption="number of clock outputs for PLL1"/>
              <param name="USBHS_NUM" value="1" caption="Number of usbhs clock requests"/>
              <param name="XOSC_ATEST_IMPLEMENTED" value="1" caption="XOSC ATEST register implemented"/>
              <param name="XOSC_ATEST_SIZE" value="4" caption="number of effective bits in XOSC ATEST register"/>
              <param name="XOSC_CFD_CLK_SELECT_SIZE" value="4" caption="Clock fail prescaler size"/>
              <param name="XOSC_CFD_HAS_RETENTION" value="0" caption="Clock fail detected for xosc is in tetention domain"/>
              <param name="INSTANCE_ID" value="6" caption="Instance index for OSCCTRL"/>
              <param name="MCLK_ID_APB" value="38" caption="Index for OSCCTRL APB clock"/>
              <param name="PAC_ID" value="6" caption="Index for OSCCTRL registers write protection"/>
            </parameters>
          </instance>
        </module>
