Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.10/PIC32CK-SG01/atdf/PIC32CK0512SG01100.atdf
      <register-group name="HMATRIX2" caption="HSB Matrix">
        <register name="MCFG" offset="0x0" rw="RW" size="4" access-size="4" count="16" initval="0x00000002" caption="Master Configuration">
          <bitfield name="ULBT" caption="Undefined Length Burst Type" mask="0x7" values="MCFG__ULBT"/>
        </register>
        <register name="SCFG" offset="0x40" rw="RW" size="4" access-size="4" count="13" initval="0x00000010" caption="Slave Configuration">
          <bitfield name="SLOT_CYCLE" caption="Maximum Number of Allowed Cycles for a Burst" mask="0x1FF"/>
          <bitfield name="DEFMSTR_TYPE" caption="Default Master Type" mask="0x30000" values="SCFG__DEFMSTR_TYPE"/>
          <bitfield name="FIXED_DEFMSTR" caption="Fixed Index of Default Master" mask="0x3C0000"/>
        </register>
        <register-group name="PRS" name-in-module="PRS" offset="0x080" size="0x8" count="13"/>
        <register name="MRCR" offset="0x100" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Master Remap Control">
          <bitfield name="RCB0" caption="Remap Command Bit for Master 0" mask="0x1" values="MRCR__RCB"/>
          <bitfield name="RCB1" caption="Remap Command Bit for Master 1" mask="0x2" values="MRCR__RCB"/>
          <bitfield name="RCB2" caption="Remap Command Bit for Master 2" mask="0x4" values="MRCR__RCB"/>
          <bitfield name="RCB3" caption="Remap Command Bit for Master 3" mask="0x8" values="MRCR__RCB"/>
          <bitfield name="RCB4" caption="Remap Command Bit for Master 4" mask="0x10" values="MRCR__RCB"/>
          <bitfield name="RCB5" caption="Remap Command Bit for Master 5" mask="0x20" values="MRCR__RCB"/>
          <bitfield name="RCB6" caption="Remap Command Bit for Master 6" mask="0x40" values="MRCR__RCB"/>
          <bitfield name="RCB7" caption="Remap Command Bit for Master 7" mask="0x80" values="MRCR__RCB"/>
          <bitfield name="RCB8" caption="Remap Command Bit for Master 8" mask="0x100" values="MRCR__RCB"/>
          <bitfield name="RCB9" caption="Remap Command Bit for Master 9" mask="0x200" values="MRCR__RCB"/>
          <bitfield name="RCB10" caption="Remap Command Bit for Master 10" mask="0x400" values="MRCR__RCB"/>
          <bitfield name="RCB11" caption="Remap Command Bit for Master 11" mask="0x800" values="MRCR__RCB"/>
          <bitfield name="RCB12" caption="Remap Command Bit for Master 12" mask="0x1000" values="MRCR__RCB"/>
          <bitfield name="RCB13" caption="Remap Command Bit for Master 13" mask="0x2000" values="MRCR__RCB"/>
          <bitfield name="RCB14" caption="Remap Command Bit for Master 14" mask="0x4000" values="MRCR__RCB"/>
          <bitfield name="RCB15" caption="Remap Command Bit for Master 15" mask="0x8000" values="MRCR__RCB"/>
        </register>
        <register name="SFR" offset="0x110" rw="RW" size="4" access-size="4" count="13" initval="0x00000000" caption="Special Function">
          <bitfield name="SFR" caption="Special Function Register" mask="0xFFFFFFFF"/>
        </register>
        <register name="MEIER" offset="0x150" rw="W" size="4" access-size="4" atomic-op="set:MEIMR" caption="Master Error Interrupt Enable">
          <bitfield name="MERR0" caption="Master 0 Access Error" mask="0x1"/>
          <bitfield name="MERR1" caption="Master 1 Access Error" mask="0x2"/>
          <bitfield name="MERR2" caption="Master 2 Access Error" mask="0x4"/>
          <bitfield name="MERR3" caption="Master 3 Access Error" mask="0x8"/>
          <bitfield name="MERR4" caption="Master 4 Access Error" mask="0x10"/>
          <bitfield name="MERR5" caption="Master 5 Access Error" mask="0x20"/>
          <bitfield name="MERR6" caption="Master 6 Access Error" mask="0x40"/>
          <bitfield name="MERR7" caption="Master 7 Access Error" mask="0x80"/>
          <bitfield name="MERR8" caption="Master 8 Access Error" mask="0x100"/>
          <bitfield name="MERR9" caption="Master 9 Access Error" mask="0x200"/>
          <bitfield name="MERR10" caption="Master 10 Access Error" mask="0x400"/>
          <bitfield name="MERR11" caption="Master 11 Access Error" mask="0x800"/>
          <bitfield name="MERR12" caption="Master 12 Access Error" mask="0x1000"/>
          <bitfield name="MERR13" caption="Master 13 Access Error" mask="0x2000"/>
          <bitfield name="MERR14" caption="Master 14 Access Error" mask="0x4000"/>
          <bitfield name="MERR15" caption="Master 15 Access Error" mask="0x8000"/>
        </register>
        <register name="MEIDR" offset="0x154" rw="W" size="4" access-size="4" atomic-op="clear:MEIMR" caption="Master Error Interrupt Disable">
          <bitfield name="MERR0" caption="Master 0 Access Error" mask="0x1"/>
          <bitfield name="MERR1" caption="Master 1 Access Error" mask="0x2"/>
          <bitfield name="MERR2" caption="Master 2 Access Error" mask="0x4"/>
          <bitfield name="MERR3" caption="Master 3 Access Error" mask="0x8"/>
          <bitfield name="MERR4" caption="Master 4 Access Error" mask="0x10"/>
          <bitfield name="MERR5" caption="Master 5 Access Error" mask="0x20"/>
          <bitfield name="MERR6" caption="Master 6 Access Error" mask="0x40"/>
          <bitfield name="MERR7" caption="Master 7 Access Error" mask="0x80"/>
          <bitfield name="MERR8" caption="Master 8 Access Error" mask="0x100"/>
          <bitfield name="MERR9" caption="Master 9 Access Error" mask="0x200"/>
          <bitfield name="MERR10" caption="Master 10 Access Error" mask="0x400"/>
          <bitfield name="MERR11" caption="Master 11 Access Error" mask="0x800"/>
          <bitfield name="MERR12" caption="Master 12 Access Error" mask="0x1000"/>
          <bitfield name="MERR13" caption="Master 13 Access Error" mask="0x2000"/>
          <bitfield name="MERR14" caption="Master 14 Access Error" mask="0x4000"/>
          <bitfield name="MERR15" caption="Master 15 Access Error" mask="0x8000"/>
        </register>
        <register name="MEIMR" offset="0x158" rw="R" size="4" access-size="4" caption="Master Error Interrupt Mask">
          <bitfield name="MERR0" caption="Master 0 Access Error" mask="0x1"/>
          <bitfield name="MERR1" caption="Master 1 Access Error" mask="0x2"/>
          <bitfield name="MERR2" caption="Master 2 Access Error" mask="0x4"/>
          <bitfield name="MERR3" caption="Master 3 Access Error" mask="0x8"/>
          <bitfield name="MERR4" caption="Master 4 Access Error" mask="0x10"/>
          <bitfield name="MERR5" caption="Master 5 Access Error" mask="0x20"/>
          <bitfield name="MERR6" caption="Master 6 Access Error" mask="0x40"/>
          <bitfield name="MERR7" caption="Master 7 Access Error" mask="0x80"/>
          <bitfield name="MERR8" caption="Master 8 Access Error" mask="0x100"/>
          <bitfield name="MERR9" caption="Master 9 Access Error" mask="0x200"/>
          <bitfield name="MERR10" caption="Master 10 Access Error" mask="0x400"/>
          <bitfield name="MERR11" caption="Master 11 Access Error" mask="0x800"/>
          <bitfield name="MERR12" caption="Master 12 Access Error" mask="0x1000"/>
          <bitfield name="MERR13" caption="Master 13 Access Error" mask="0x2000"/>
          <bitfield name="MERR14" caption="Master 14 Access Error" mask="0x4000"/>
          <bitfield name="MERR15" caption="Master 15 Access Error" mask="0x8000"/>
        </register>
        <register name="MESR" offset="0x15C" rw="R" size="4" access-size="4" atomic-op="clear:MESR" caption="Master Error Status">
          <bitfield name="MERR0" caption="Master 0 Access Error" mask="0x1"/>
          <bitfield name="MERR1" caption="Master 1 Access Error" mask="0x2"/>
          <bitfield name="MERR2" caption="Master 2 Access Error" mask="0x4"/>
          <bitfield name="MERR3" caption="Master 3 Access Error" mask="0x8"/>
          <bitfield name="MERR4" caption="Master 4 Access Error" mask="0x10"/>
          <bitfield name="MERR5" caption="Master 5 Access Error" mask="0x20"/>
          <bitfield name="MERR6" caption="Master 6 Access Error" mask="0x40"/>
          <bitfield name="MERR7" caption="Master 7 Access Error" mask="0x80"/>
          <bitfield name="MERR8" caption="Master 8 Access Error" mask="0x100"/>
          <bitfield name="MERR9" caption="Master 9 Access Error" mask="0x200"/>
          <bitfield name="MERR10" caption="Master 10 Access Error" mask="0x400"/>
          <bitfield name="MERR11" caption="Master 11 Access Error" mask="0x800"/>
          <bitfield name="MERR12" caption="Master 12 Access Error" mask="0x1000"/>
          <bitfield name="MERR13" caption="Master 13 Access Error" mask="0x2000"/>
          <bitfield name="MERR14" caption="Master 14 Access Error" mask="0x4000"/>
          <bitfield name="MERR15" caption="Master 15 Access Error" mask="0x8000"/>
        </register>
        <register name="MEAR" offset="0x160" rw="R" size="4" access-size="4" count="16" caption="Master Error Address">
        </register>
      </register-group>
      <value-group name="MCFG__ULBT">
        <value name="INFINITE" caption="Infinite Length" value="0"/>
        <value name="SINGLE" caption="Single Access" value="1"/>
        <value name="FOUR_BEAT" caption="Four Beat Burst" value="2"/>
        <value name="EIGHT_BEAT" caption="Eight Beat Burst" value="3"/>
        <value name="SIXTEEN_BEAT" caption="Sixteen Beat Burst" value="4"/>
      </value-group>
      <value-group name="SCFG__DEFMSTR_TYPE">
        <value name="NO_DEFAULT" caption="No Default Master. At the end of current slave access, if no other master request is pending, the slave is deconnected from all masters. This resusts in having a one cycle latency for the first transfer of a burst." value="0"/>
        <value name="LAST_DEFAULT" caption="Last Default Master At the end of current slave access, if no other master request is pending, the slave stay connected with the last master havingaccessed it.This resusts in not having the one cycle latency when the last master re-trying access on the slave." value="1"/>
        <value name="FIXED_DEFAULT" caption="Fixed Default Master At the end of current slave access, if no other master request is pending, the slave connects with fixed master which numberis in FIXED_DEFMSTR register.This resusts in not having the one cycle latency when the fixed master re-trying access on the slave." value="2"/>
      </value-group>
      <value-group name="MRCR__RCB">
        <value name="DIS" caption="Disable remapped address decoding for master" value="0"/>
        <value name="ENA" caption="Enable remapped address decoding for master" value="1"/>
      </value-group>
    </module>
    <module name="HSM" id="03785" name2="sec_hsm_v1" version="1b0" caption="Hardware Security Module">
      <register-group name="HSM" caption="Hardware Security Module">
        <register name="CTRLA" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="CONTROL REGISTER A">
          <bitfield name="ENABLE" caption="Clock Enable bit" mask="0x2"/>
          <bitfield name="PRIV" caption="Privileged Access Only bit" mask="0x4"/>
          <bitfield name="RUNSTDBY" caption="Run In Standby bit" mask="0x40"/>
        </register>
        <register name="CTRLB" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="CONTROL REGISTER B">
          <bitfield name="CANCEL" caption="Cancel Command" mask="0x1"/>
        </register>
        <register name="INTENCLR" offset="0x8" rw="RW" size="4" atomic-op="clear:INTENCLR" initval="0x00000000" caption="INTERRUPT ENABLE CLEAR REGISTER">
          <bitfield name="ERROR" caption="Error Interrupt Enable" mask="0x1"/>
          <bitfield name="TAMPER" caption="Tamper Interrupt Enable" mask="0x2"/>
        </register>
