Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.10/PIC32CK-SG01/atdf/PIC32CK0512SG01100.atdf
        <register name="RLAR_A" offset="0x18" rw="RW" size="4" access-size="4" count="4" caption="MPU Region Limit Address Register Alias x">
          <bitfield name="EN" caption="Region enable" mask="0x1"/>
          <bitfield name="AttrInd" caption="Attribute Index" mask="0xE"/>
          <bitfield name="LIMIT" caption="Limit address" mask="0xFFFFFFE0"/>
        </register>
        <register name="MAIR0" offset="0x30" rw="RW" size="4" access-size="4" caption="MPU Memory Attribute Indirection Register 0">
          <bitfield name="Attr0" caption="Attribute of MPU region 0" mask="0xFF"/>
          <bitfield name="Attr1" caption="Attribute of MPU region 1" mask="0xFF00"/>
          <bitfield name="Attr2" caption="Attribute of MPU region 2" mask="0xFF0000"/>
          <bitfield name="Attr3" caption="Attribute of MPU region 3" mask="0xFF000000"/>
        </register>
        <register name="MAIR1" offset="0x34" rw="RW" size="4" access-size="4" caption="MPU Memory Attribute Indirection Register 1">
          <bitfield name="Attr4" caption="Attribute of MPU region 4" mask="0xFF"/>
          <bitfield name="Attr5" caption="Attribute of MPU region 5" mask="0xFF00"/>
          <bitfield name="Attr6" caption="Attribute of MPU region 6" mask="0xFF0000"/>
          <bitfield name="Attr7" caption="Attribute of MPU region 7" mask="0xFF000000"/>
        </register>
      </register-group>
      <value-group name="RBAR__AP">
        <value name="RWPRIV" caption="Read/write by privileged code only" value="0"/>
        <value name="RWANY" caption="Read/write by any privilege level" value="1"/>
        <value name="RPRIV" caption="Read-only by privileged code only" value="2"/>
        <value name="RANY" caption="Read-only by any privilege level" value="3"/>
      </value-group>
      <value-group name="RBAR__SH">
        <value name="NO" caption="Non-shareable" value="0"/>
        <value name="OUTER" caption="Outer shareable" value="2"/>
        <value name="INNER" caption="Inner shareable" value="3"/>
      </value-group>
      <value-group name="RBAR_A__AP">
        <value name="RWPRIV" caption="Read/write by privileged code only" value="0"/>
        <value name="RWANY" caption="Read/write by any privilege level" value="1"/>
        <value name="RPRIV" caption="Read-only by privileged code only" value="2"/>
        <value name="RANY" caption="Read-only by any privilege level" value="3"/>
      </value-group>
      <value-group name="RBAR_A__SH">
        <value name="NO" caption="Non-shareable" value="0"/>
        <value name="OUTER" caption="Outer shareable" value="2"/>
        <value name="INNER" caption="Inner shareable" value="3"/>
      </value-group>
    </module>
    <module name="NVIC" id="SYSTEM_IP" version="1.0.0" caption="Nested Vectored Interrupt Controller">
      <register-group name="NVIC" caption="Nested Vectored Interrupt Controller">
        <register name="ISER" offset="0x0" rw="RW" size="4" access-size="4" count="5" caption="Interrupt Set Enable Register n">
          <bitfield name="SETENA" caption="Set enable" mask="0xFFFFFFFF"/>
        </register>
        <register name="ICER" offset="0x80" rw="RW" size="4" access-size="4" count="5" caption="Interrupt Clear Enable Register n">
          <bitfield name="CLRENA" caption="Clear enable" mask="0xFFFFFFFF"/>
        </register>
        <register name="ISPR" offset="0x100" rw="RW" size="4" access-size="4" count="5" caption="Interrupt Set Pending Register n">
          <bitfield name="SETPEND" caption="Set pending" mask="0xFFFFFFFF"/>
        </register>
        <register name="ICPR" offset="0x180" rw="RW" size="4" access-size="4" count="5" caption="Interrupt Clear Pending Register n">
          <bitfield name="CLRPEND" caption="Clear pending" mask="0xFFFFFFFF"/>
        </register>
        <register name="IABR" offset="0x200" rw="R" size="4" access-size="4" count="5" caption="Interrupt Active Bit Register n">
          <bitfield name="ACTIVE" caption="Active state" mask="0xFFFFFFFF"/>
        </register>
        <register name="ITNS" offset="0x280" rw="RW" size="4" access-size="4" count="5" caption="Interrupt Target Non-secure Register n">
          <bitfield name="ITNS" caption="Interrupt Targets Non-secure" mask="0xFFFFFFFF"/>
        </register>
        <register name="IPR" offset="0x300" rw="RW" size="4" access-size="4" count="40" caption="Interrupt Priority Register n">
          <bitfield name="PRI_N0" caption="Priority of interrupt number 4n+0" mask="0xFF"/>
          <bitfield name="PRI_N1" caption="Priority of interrupt number 4n+1" mask="0xFF00"/>
          <bitfield name="PRI_N2" caption="Priority of interrupt number 4n+2" mask="0xFF0000"/>
          <bitfield name="PRI_N3" caption="Priority of interrupt number 4n+3" mask="0xFF000000"/>
        </register>
      </register-group>
    </module>
    <module name="OSC32KCTRL" id="03717" name2="osc_osc32kctrl_u2400_v2" version="2a0" caption="32kHz Oscillators Control">
      <register-group name="OSC32KCTRL" caption="32kHz Oscillators Control">
        <register name="INTENCLR" offset="0x0" rw="RW" size="4" atomic-op="clear:INTENCLR" initval="0x00000000" caption="Interrupt Enable Clear">
          <bitfield name="XOSC32KRDY" caption="XOSC32K Ready Interrupt Enable" mask="0x1"/>
          <bitfield name="XOSC32KFAIL" caption="XOSC32K Clock Failure Detector Interrupt Enable" mask="0x4"/>
        </register>
        <register name="INTENSET" offset="0x4" rw="RW" size="4" atomic-op="set:INTENSET" initval="0x00000000" caption="Interrupt Enable Set">
          <bitfield name="XOSC32KRDY" caption="XOSC32K Ready Interrupt Enable" mask="0x1"/>
          <bitfield name="XOSC32KFAIL" caption="XOSC32K Clock Failure Detector Interrupt Enable" mask="0x4"/>
        </register>
        <register name="INTFLAG" offset="0x8" rw="RW" size="4" atomic-op="clear:INTFLAG" initval="0x00000000" caption="Interrupt Flag Status and Clear">
          <bitfield name="XOSC32KRDY" caption="XOSC32K Ready" mask="0x1"/>
          <bitfield name="XOSC32KFAIL" caption="XOSC32K Clock Failure Detector" mask="0x4"/>
        </register>
